package atguigu;

import java.util.Scanner;

public class Java014_Class {}

/*
OOP   面向对象 object-oriented
        三条主线：
            1.Java类及类的成员：属性，方法，构造器；代码块，内部类
            2.面向对象的三大特征：【封装性，继承性，多态性】，（抽象性）
            3.其他关键字：this super final abstract，interface
                        package，import
             大处着眼，小处着手

       人把大象装冰箱 解释【面向过程】与【面向对象】的异同
       面向过程：强调的是功能和行为，以函数为最小单位，考虑怎么做
            执行者
       面向对象，强调的是具备了功能的对象，以类和对象为最想单位，考虑谁来做

            人{
                打开（冰箱）{
                        冰箱，打开
                    }
                抬起（大象）{
                        大象，进入冰箱
                    }
                关闭（冰箱）{
                        冰箱，关上
                    }
                }
             大象{
             }
             冰箱{
             }
      代码量庞大，减少代码，逻辑清晰，功能清晰
      指挥者
      一般名词是类，动词是对象方法

      类：
        是对一类事物的抽象的概念的定义
      对象：
        是实际存在的的个体，也称为实例

       重点是类的设计
            设计类的成员

 */

